# 2 - Series and DataFrames

## 1 - DataFrames
* DataFrame = zwei Dim Array

In [20]:
import pandas as pd;

oo = pd.read_csv('./ALL MEDALISTS.csv', skiprows=4)
oo.head()

oo # ersten 30 Rows und letzte 20 rows anzeigen

          City  Edition  ... Event_gender   Medal
0       Athens     1896  ...            M    Gold
1       Athens     1896  ...            M  Silver
2       Athens     1896  ...            M  Bronze
3       Athens     1896  ...            M    Gold
4       Athens     1896  ...            M  Silver
...        ...      ...  ...          ...     ...
29211  Beijing     2008  ...            M  Silver
29212  Beijing     2008  ...            M  Bronze
29213  Beijing     2008  ...            M  Bronze
29214  Beijing     2008  ...            M    Gold
29215  Beijing     2008  ...            M  Silver

[29216 rows x 10 columns]

## 2 - Serie
* Series = one-Di Array von indexierten Daten = eigentlich Spalten oder Zeilen
* Acces:
    1. `DataFrame['SeriesName']` - wird immer Funktionieren
    2. `DataFrame.SeriesName` - funktioniert nicht wenn SpaltenName Leerzeichen hat.
    3. `DataFrame[['SeriesName1', 'SeriesName2']] - mehrere Spalten ansprechen 
* `type(DataFrame)` - gibt Typ des Objects an = z.B Ob Series oder DataFrame

In [27]:
print(oo['City'])
print(oo['Athlete'])
print(oo.Athlete)
oo[['City', 'Edition', 'Athlete']]

0         Athens
1         Athens
2         Athens
3         Athens
4         Athens
          ...
29211    Beijing
29212    Beijing
29213    Beijing
29214    Beijing
29215    Beijing
Name: City, Length: 29216, dtype: object
0               HAJOS, Alfred
1            HERSCHMANN, Otto
2           DRIVAS, Dimitrios
3          MALOKINIS, Ioannis
4          CHASAPIS, Spiridon
                 ...
29211          ENGLICH, Mirko
29212    MIZGAITIS, Mindaugas
29213         PATRIKEEV, Yuri
29214           LOPEZ, Mijain
29215          BAROEV, Khasan
Name: Athlete, Length: 29216, dtype: object
0               HAJOS, Alfred
1            HERSCHMANN, Otto
2           DRIVAS, Dimitrios
3          MALOKINIS, Ioannis
4          CHASAPIS, Spiridon
                 ...
29211          ENGLICH, Mirko
29212    MIZGAITIS, Mindaugas
29213         PATRIKEEV, Yuri
29214           LOPEZ, Mijain
29215          BAROEV, Khasan
Name: Athlete, Length: 29216, dtype: object

          City  Edition               Athlete
0       Athens     1896         HAJOS, Alfred
1       Athens     1896      HERSCHMANN, Otto
2       Athens     1896     DRIVAS, Dimitrios
3       Athens     1896    MALOKINIS, Ioannis
4       Athens     1896    CHASAPIS, Spiridon
...        ...      ...                   ...
29211  Beijing     2008        ENGLICH, Mirko
29212  Beijing     2008  MIZGAITIS, Mindaugas
29213  Beijing     2008       PATRIKEEV, Yuri
29214  Beijing     2008         LOPEZ, Mijain
29215  Beijing     2008        BAROEV, Khasan

[29216 rows x 3 columns]

In [22]:
type(oo)

pandas.core.frame.DataFrame

In [23]:
type(oo['City'])

pandas.core.series.Series

## 3 - Challenge/Solution
1. Olympics DataFrame auflisten
2. List nur `NOC`-Column + welcher Typ
3. List `Edition`, `City`, `Athlete`, `Medal` + welcher Typ

In [31]:
oo.head()
print(oo)
print(oo['NOC'])
print(type(oo['NOC']))

oo[['Edition', 'City', 'Athlete', 'Medal']] # innere [] = Python List
print(type(oo[['Edition', 'City', 'Athlete', 'Medal']]))

City  Edition  ... Event_gender   Medal
0       Athens     1896  ...            M    Gold
1       Athens     1896  ...            M  Silver
2       Athens     1896  ...            M  Bronze
3       Athens     1896  ...            M    Gold
4       Athens     1896  ...            M  Silver
...        ...      ...  ...          ...     ...
29211  Beijing     2008  ...            M  Silver
29212  Beijing     2008  ...            M  Bronze
29213  Beijing     2008  ...            M  Bronze
29214  Beijing     2008  ...            M    Gold
29215  Beijing     2008  ...            M  Silver

[29216 rows x 10 columns]
0        HUN
1        AUT
2        GRE
3        GRE
4        GRE
        ...
29211    GER
29212    LTU
29213    ARM
29214    CUB
29215    RUS
Name: NOC, Length: 29216, dtype: object
<class 'pandas.core.series.Series'>
<class 'pandas.core.frame.DataFrame'>